{
    "page2": 
    [
        {
              "group1":
        [
            {
                "name":" Doug Lineberry",
                "title": "Patent Attorney",
                "company": "XYZ Law Firm",
                "picture": "https://www.bmwsupplierxchange.com/images/speakers/Doug%20Lineberry.png",
                "bio":"Doug is a seasoned intellectual property attorney with a strong fundamental and technical understanding of the industry. His practice focuses on the protection of intellectual property through patent, trademark, and copyright prosecution, as well as intellectual property litigation. He approaches each case with compassion and insight, recognizing the added value that trust and clear communication can bring to strong client relationships. He has extensive experience prosecuting patent applications across mechanical, medical, and chemical technologies. Additionally, he has continually advised clients on building and protecting trademark portfolios, including monitoring for third-party use and pursuing enforcement actions when necessary. Doug earned his B.S. in Biology and B.A. in Chemistry from Emory & Henry University. He earned his J.D. from Mercer University School of Law. He never wavered in his desire to become a lawyer, understanding that serving as an attorney perfectly combined his innate desire to help others achieve their goals with his strong technical and scientific background. His curiosity, dedication, and passion uniquely position him to handle a wide range of intellectual property matters"
            }
        ]
        },
        {
            "group2":
            [
                {
                    "name": "Christian Feilmeier",
                    "title": "President",
                    "company": "RPC USA",
                    "picture": "https://www.bmwsupplierxchange.com/images/speakers/Christian%20Feilmeier.png",
                    "bio":"Feilmeier has spent his career leading transformation at the point where global strategy meets local reality. From boardrooms in Munich to dealer networks across Europe, North America, and Asia, Christian has worked with leaders navigating change in complex, highly competitive environments. Early in his career at the BMW Group, he learned that performance improvement isn’t driven by slogans or systems alone: it is driven by leadership that understands culture, incentives, and execution at every level of the organization. He brings a rare combination of financial discipline, strategic clarity, and hands-on operational leadership to organizations undergoing transformation. Christian has led some of the automotive industry’s most consequential transformation initiatives. He played a key role in the implementation of the agency sales model in Europe, helping redesign how vehicles are sold, priced, and delivered. He has driven digitalization efforts across dealer networks, supported AI-powered customer interaction strategies, and led the founding of new companies in Germany, the United States, and China, building complete leadership teams from the ground up. What defines Christian as a leader and as a speaker is his international and intercultural perspective. Fluent in German, English, and French, he understands that leadership does not translate word-for-word across borders. It must be adapted, contextualized, and executed with empathy and precision. His keynotes help leaders understand how to balance innovation with discipline, global consistency with local flexibility, and technology with human connection. Transformation succeeds when strategy, culture, and execution move together—across borders, teams, and markets"
                },
                {
                    "name": "Joseph Lopane",
                    "title": "Vice President",
                    "company": "RPC USA",
                    "picture": "https://www.bmwsupplierxchange.com/images/speakers/Joseph%20Lopane.png",
                    "bio":"Joseph Lopane, Vice President, rpc USA Long before he became a vice president, executive coach, and trusted advisor to global brands, Joseph was turning wrenches, writing repair orders, selling on showroom floors, managing service departments, and carrying the weight of full P&L responsibility. That lived experience—earned over three decades in automotive retail—is what gives his message its credibility. He doesn’t speak about leadership from theory. He speaks from experience. Joseph’s work sits at the intersection of leadership, performance, and human behavior. Asa Senior Executive Coach for over a decade, he has helped leaders strengthen emotional intelligence, elevate employee engagement, and build cultures that deliver both exceptional customer experience and sustainable financial results. His coaching blends strategic financial planning, sales process excellence, and organizational development with a deep understanding of what truly motivates people. Joseph has led and delivered flagship programs and executive coaching initiatives, served as a consultant on mergers and acquisitions, helped leaders navigate growth, transition, and cultural integration. He is known for his authenticity, emotional intelligence, and straight-talk delivery, challenging leaders to look inward before they look outward and to recognize that sustainable performance is built on trust, clarity, and energy, not pressure alone: Great leadership isn’t positional. It’s personal"
                },
                {
                    "name": "Stephen Thomas",
                    "title": "Associate VP",
                    "company": "RPC USA",
                    "picture": "https://www.bmwsupplierxchange.com/images/speakers/Stephen%20Thomas.png",
                    "bio":"Thomas has spent his career solving the problems that most organizations feel, but struggle to name. Across consulting, retail performance, and large-scale transformation initiatives, he has worked where strategy meets execution, helping leaders turn complex plans into clear action. Stephen serves as Associate Vice President at rpc USA, where he leads cross-functional teams, oversees mission-critical initiatives, and helps organizations deliver results within the realities of time, budget, and human capacity. His expertise spans project leadership, operational execution, client strategy, workforce development, and organizational alignment—skills sharpened over more than two decades inside consulting and performance-driven environments. Before stepping into executive leadership, Stephen spent over eight years advising organizations on performance improvement across the AEC and professional services sectors. What distinguishes Stephen as a speaker and leader is his ability to communicate complexity with clarity. With a background in Mass Communication, studies in Architecture and Building Sciences, and certification in Project Management, he brings both structural thinking and human insight to the stage, blending real-world execution lessons with practical frameworks leaders can apply immediately. On stage, Stephen is known for being grounded, pragmatic, and deeply relatable. He speaks to leaders who are navigating growth, change, and execution pressure, offering tools to organize work, align teams, and build momentum without burning people out. His motto is: Great outcomes aren’t accidental. They’re designed, communicated, and executed—one decision at a time"
                }
            ]
        },
        {
            "group3":
            [
                {
                    "name": "Phillip Baltazar",
                    "title": "Executive Advisor",
                    "company": "Reiden Group",
                    "picture": "https://www.bmwsupplierxchange.com/images/speakers/Phillip%20Baltazar.png",
                    "bio":"For more than two decades, Philip Baltazar has worked at the intersection of strategy, leadership, and execution, where bold vision becomes reality. Today, he helps leaders turn complexity into clarity and momentum. As Founder and CEO of Reiden Group, he advises CEOs, founders, and private equity sponsors on enterprise growth, turnarounds, and value creation, delivering consistent20–30%profitability lifts by aligning human capital, operating models, and strategy execution. His experience spans financial services, fintech, real estate, and private equity–backed businesses, where he has led capital raises, guided M&A strategy, and helped organizations scale without losing their culture or their soul. Phillip built and scaled businesses from the ground up. He founded a specialized lending platform, raised capital, and captured underserved markets through borrower-first innovation. As SVP at New Day USA, he launched a division from zero to 100+ transactions per month, reaching profitability in under six months while building a high-performing team and national brand presence. Across prior executive roles, he helped originate over $8 billion in loan volume, launching direct-to-consumer platforms and strategic partnerships with companies like Costco and Google. What sets him apart is not just what he’s built, but how. As an executive advisor at Culture Index, he worked with C-suite teams to reduce turnover and increase profitability, proving that culture, when measured and aligned, is not a soft concept: it’s a growth engine. A global citizen who has lived and worked across Europe, Africa, and the Americas, Phillip brings a rare perspective on leadership across cultures, markets, and economic cycles. He is also deeply committed to mentorship and service, supporting organizations that help young people build discipline, confidence, and direction"
                }
            ]
        }
    ],
    "page1": [
        {
        "group1":
        [
            {
                "name": "Dr. Berkley Baker",
                "title": "Founder & CEO",
                "company": "CIMI Solutions",
                "picture": "https://www.bmwsupplierxchange.com/images/speakers/Dr%20Berkley%20Baker.png",
                "bio":"Dr. Berkley Baker is a visionary leader with over two decades of experience in sales, marketing, and leadership development. His impact has reached across industries, as he’s consulted with more than 100 executive teams, guiding them in navigating the implementation of disruptive technologies and fostering leadership excellence. Throughout his career, Dr. Baker has held pivotal roles, including Vice President of Sales and Business Development for a healthcare technology firm. He’s renowned for his innovative training programs and strategic consulting for organizations ranging from hospital systems to medical device companies. His expertise in leadership development and change management has impacted over 1,000 leaders in diverse roles, including sales, marketing, human resources, operations, engineering, finance, and beyond. Dr. Baker’s passion for nurturing innovation is evident in his role as a startup coach for the Advanced Technology Development Center at Georgia Tech, where he has mentored and supported 60-80 HealthTech startups in developing and commercializing transformative technology solutions. He’s also left his mark internationally, conducting sales training and mentoring programs in both the United States and China. In addition to his corporate contributions, Dr. Baker serves as a Professor of Practice at the Entrepreneurship and Innovation Institute at Georgia State University. His dedication to education extends to his roles as an affiliate professor at the University of North Carolina, Morehouse College, and Mercer University. Dr. Baker’s impressive educational journey includes a doctorate in business from Georgia State University’s Robinson College of Business, an MBA from Emory University’s Goizueta Business School, and a bachelor’s degree in economics from the U.S. Military Academy at West Point. Dr. Berkley Baker’s story continues to inspire and shape the future of organizational growth and excellence across diverse industries"
            }
        ]
         },
         {
            "group2":
            [
                {
                    "name": "Dr. José Sagarnaga",
                    "title": "Professor & Global Management Discipline Coordinator",
                    "company": "Clemson University",
                    "picture": "https://www.bmwsupplierxchange.com/images/speakers/Dr%20Josef%20Sagarnaga.png",
                    "bio":"Dr. José A. Sagarnaga is an award-winning global business educator and a leading voice on cross-cultural leadership and purpose-driven management. He serves as a Clinical Associate Professor in the Department of Management at Clemson University, where he coordinates the Global Management discipline area. A 2025 TEDx Clemson U speaker, Dr. Sagarnaga is known for combining compelling storytelling with research-based insights. His TEDx Talk, “Finding Your Purpose One Small Action at a Time,” draws on a personal experience that led him to a transformative journey in Bangladesh, shaping his life’s commitment to global education and service. With over two decades of international experience spanning 52 countries and programs developed in 21 nations, he brings a uniquely global perspective to leadership development, organizational culture, and the future of work."
                }
            ]
         },
         {
            "group3":
            [
                {
                    "name": "Melissa L. Lindler, MPA, PMP",
                    "title": "District Director, SC District Office",
                    "company": "Small Business Administration",
                    "picture": "https://www.bmwsupplierxchange.com/images/speakers/Melissa%20L%20Lindler.png",
                    "bio":"Melissa Lindler joined the U.S. Small Business Administration in January 2025 as District Director of the South Carolina District Office, where she oversees SBA operations statewide and works to ensure entrepreneurs and small businessowners have access to the tools, resources, and support needed to start, grow, and thrive. In this role, she also leads the delivery of SBA programs and cultivates strategic partnerships with lenders, resource partners, and key stakeholders across South Carolina. Throughout her career, Ms. Lindler has held senior leadership roles across the public and nonprofit sectors. Prior to SBA, she served as Chief of Staff for the Southeast Crescent Regional Commission (SCRC), a federal-state partnership authorized by Congress to advance economic and infrastructure development across a seven-state region encompassing 428 counties. She served as a strategic advisor to agency leadership, supporting regional development, job creation, and community investment initiatives. Ms. Lindler served as Director of the City of Columbia’s Office of Business Opportunities, where she led efforts to support small, minority-and women-owned businesses through technical assistance, access to capital, and supplier development initiatives. Her responsibilities included oversight of commercial revolving loan funds, disparity study implementation, small business training and technical assistance, commercial retention and redevelopment efforts. Earlier in her career, Ms. Lindler spent 12 years with the U.S. House of Representatives as Director of District Planning and Outreach, where she supported constituents with federal funding navigation, policy development related to education and youth, district operations, and district budget management. A native of Irmo, South Carolina, Ms. Lindler holds a Bachelor of Arts in Political Science and a Master of Public Administration from the University of South Carolina. She also holds a graduate certificate in public management from Indiana University–Purdue University Indianapolis, is a Project Management Professional (PMP), and a Furman University Riley Leadership Institute Fellow"
                },
                {
                    "name": "Earl Gregorich, CBA",
                    "title": "Outreach & Marketing Specialist",
                    "company": "Small Business Administration",
                    "picture": "https://www.bmwsupplierxchange.com/images/speakers/Earl%20Gregorich.png",
                    "bio":"Earl is a USAF veteran, graduated with a BS degree from Wright State University, and has had a 20+year career with US Small Business Administration resource partners, consulting business owners and administering business and economic development programs. Earl serves the 20 Upstate counties of South Carolina and is experienced in providing guidance on SBA lending programs, government contracting programs, SBA disaster relief programs and business development training."
                }
            ]
         }
]
}
